Day-11/flow_through_pipe_dia_0.05m/case_with_minor_issues/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2312                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

scale   1;

vertices
(
    (-0.05 -0.05  -0.25)
    ( 0.05 -0.05  -0.25)
    ( 0.05  0.05  -0.25)
    (-0.05  0.05  -0.25)
    (-0.05 -0.05   1.25)
    ( 0.05 -0.05   1.25)
    ( 0.05  0.05   1.25)
    (-0.05  0.05   1.25)
);

blocks
(
    hex (0 1 2 3 4 5 6 7) (25 25 375) simpleGrading (1 1 1)
);

edges
(
);

boundary
(
    frontAndBack
    {
        type patch;
        faces
        (
            (3 7 6 2)
            (1 5 4 0)
        );
    }
    Inlet_1
    {
        type patch;
        faces
        (
            (0 4 7 3)
        );
    }
    Outlet_1
    {
        type patch;
        faces
        (
            (2 6 5 1)
        );
    }
    lowerWall
    {
        type wall;
        faces
        (
            (0 3 2 1)
        );
    }
    upperWall
    {
        type patch;
        faces
        (
            (4 5 6 7)
        );
    }
);


// ************************************************************************* //
