Day-11/flow_through_pipe_dia_0.05m/case_with_minor_issues/0/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2312                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //


dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0, 0, 0);

boundaryField
{
    inlet
    {
        type         fixValue;
        value        uniform (0 0 0.02);
    }

    outlet
    {
        type         zeroGradient;
        
    }

    wall
    {
        type         noSlip;
        
    }
}


// ************************************************************************* //
